касса_Вегас/src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>УстройствоВвода</name>
    <comment>InputDevice</comment>
  </enumValues>
  <enumValues>
    <name>ККТ</name>
    <comment>KKT</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплеиПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяСистема</name>
    <comment>PaymentSystem</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Catalogs/ДрайверыОборудования/ДрайверыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДрайверыОборудования</name>
  <predefined>
    <items>
      <name>Драйвер1ССканерШтрихкода</name>
      <description>1С:Cканер штрихкода (Native)</description>
    </items>
    <items>
      <name>Драйвер1СДисплейПокупателяWin</name>
      <description>1С:Дисплей покупателя (Windows)</description>
    </items>
    <items>
      <name>Драйвер1СДрайверFPrint11</name>
      <description>1С:Драйвер FPrint-11</description>
    </items>
    <items>
      <name>Драйвер1СПринтерЧеков</name>
      <description>1С:Принтер чеков</description>
    </items>
    <items>
      <name>Драйвер1СУстройствоВвода</name>
      <description>1С:Устройство ввода</description>
    </items>
    <items>
      <name>ДрайверIboxProПлатежнаяСистема</name>
      <description>2Can:Сервис приема платежей</description>
    </items>
    <items>
      <name>ДрайверCASЭлектронныеВесыWin</name>
      <description>CAS:Электронные весы (Windows)</description>
    </items>
    <items>
      <name>ДрайверRightScanККТ54ФЗ</name>
      <description>RightScan:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверRightScanУстройстваВвода</name>
      <description>RightScan:Устройства ввода данных ТСД Urovo</description>
    </items>
    <items>
      <name>ДрайверRightScanУстройствоПечати</name>
      <description>RightScan:Устройство печати ТСД Urovo</description>
    </items>
    <items>
      <name>ДрайверScanPortУстройстваВвода</name>
      <description>ScanPort:Устройства ввода данных</description>
    </items>
    <items>
      <name>ДрайверАЗУРККТ54ФЗ</name>
      <description>АЗУР:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверАЗУРПлатежнаяСистема</name>
      <description>АЗУР:Платежная система</description>
    </items>
    <items>
      <name>ДрайверАТОЛККТ54ФЗ9X</name>
      <description>АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверАТОЛККТ54ФЗ10X</name>
      <description>АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ) 10.x</description>
    </items>
    <items>
      <name>ДрайверАТОЛЭлектронныеВесыWin</name>
      <description>АТОЛ:Электронные весы (Windows)</description>
    </items>
    <items>
      <name>ДрайверВерсияТККТ54ФЗ</name>
      <description>Версия-Т:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверInpasПлатежнаяСистема</name>
      <description>ИНПАС:Эквайринг-терминал</description>
    </items>
    <items>
      <name>ДрайверСканситиУстройстваВвода</name>
      <description>СКАН СИТИ:Устройства ввода данных</description>
    </items>
    <items>
      <name>ДрайверСканкодСканерШтрихкода</name>
      <description>СКАНКОД:Cканер штрихкода Chipherlab (Native)</description>
    </items>
    <items>
      <name>ДрайверШтрихМККТ54ФЗ</name>
      <description>Штрих-М:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверШтрихМККТ54ФЗWin</name>
      <description>Штрих-М:ККТ с передачей данных в ОФД (Windows)</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановкаИзМакета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтеграционноеПриложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

касса_Вегас/src/CommonModules/МенеджерОборудованияВызовСервераПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает список доступных типов оборудования.
// 
// Возвращаемое значение:
//   Массив - Массив доступных типов подключаемого оборудования в конфигурации.
//
Функция ПолучитьДоступныеТипыОборудования() Экспорт
	
	СписокОборудования = Новый Массив;
	
	// Устройство ввода
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода);
	// Конец Устройство ввода.
	
	// ККТ с передачей данных
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ККТ);
	// Конец ККТ с передачей данных.
	
	// Фискальные регистраторы
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор);
	// Конец Фискальные регистраторы.
	
	// Принтер чеков
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков);
	// Конец принтер чеков.
	
	// Платежные cистемы
	СписокОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема);
	// Конец Платежные cистемы.
	
	Возврат СписокОборудования;
	
КонецФункции

// Обновить поставляемые драйверы в составе конфигурации
//                                   
Процедура ОбновитьПоставляемыеДрайвера() Экспорт
	
	// Мультиплатформенные драйвера
	
	// ККТ с передачей данных
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверАТОЛККТ54ФЗ9X",
		"АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.ATOL_KKT_1C83_V9",
		Ложь,
		"9.12.4.6377");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверАТОЛККТ54ФЗ10X",   
		"АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ) 10.x",
		"AddIn.ATOL_KKT_1C83_V10", 
		Ложь,
		"10.4.4.0");
	// Конец ККТ с передачей данных.
	
	// Принтеры чеков
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков,
		"Драйвер1СПринтерЧеков", 
		"1С:Принтер чеков",
		"AddIn.ReceiptPrinterNative", 
		Ложь,
		"3.0.2.0");
	// Конец Принтеры чеков
	
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"Драйвер1ССканерШтрихкода",
		"1С:Cканер штрихкода (Native)",
		"AddIn.InputDevice",
		Ложь,
		"9.0.4.5");
	
#Если МобильноеПриложениеСервер Тогда
	
	// ККТ с передачей данных
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверВерсияТККТ54ФЗ",
		"Версия-Т:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.VT_KKT_1CInt",
		Ложь,
		"1.0.3");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверШтрихМККТ54ФЗ",
		"Штрих-М:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.com_shtrih_jpos1c",
		Ложь,
		"1.16.1");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверАЗУРККТ54ФЗ",
		"АЗУР:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.com_azurpos_fz54_AzurPos",
		Ложь,
		"1.0.5.6");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ККТ,
		"ДрайверRightScanККТ54ФЗ",
		"RightScan:ККТ с передачей данных в ОФД (54-ФЗ)",
		"AddIn.FNCore",
		Ложь,
		"1.23");
	// Конец ККТ с передачей данных.
	
	// Фискальные регистраторы
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор,
		"Драйвер1СДрайверFPrint11", 
		"1С:Драйвер FPrint-11",
		"com.e1c.driverforatolkkm", 
		Истина,
		"2.0.7.2");
	// Конец Фискальные регистраторы
	
	// Принтеры чеков
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков,
		"ДрайверRightScanУстройствоПечати", 
		"RightScan:Устройство печати ТСД Urovo",
		"AddIn.RSPrinter",
		Ложь,
		"1.15");
	// Конец принтеров чеков
	
	// Устройство ввода
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"Драйвер1СУстройствоВвода", 
		"1С:Устройство ввода",
		"com.e1c.inputdevice",
		Истина,
		"1.0.1.2");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверСканкодСканерШтрихкода", 
		"СКАНКОД:Cканер штрихкода Chipherlab (Native)",
		"AddIn.ScancodeBarcodeScannerCPT",
		Ложь,
		"1.0.0.23");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверRightScanУстройстваВвода", 
		"RightScan:Устройства ввода данных ТСД Urovo",
		"AddIn.RSDriver",
		Ложь,
		"1.20");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверScanPortУстройстваВвода",
		"ScanPort:Устройства ввода данных",
		"AddIn.ScanportScanner",
		Ложь,
		"2.0.0.2");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.УстройствоВвода,
		"ДрайверСканситиУстройстваВвода",
		"СКАН СИТИ:Устройства ввода данных",
		"AddIn.ScanCityNewlandBarcode",
		Ложь,
		"1.0.1.3");
	// Конец устройство ввода

	// Платежные cистемы
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"ДрайверInpasПлатежнаяСистема", 
		"ИНПАС:Эквайринг-терминал",
		"com.inpas.dualconnector1c",
		Истина,
		"1.6");
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"ДрайверIboxProПлатежнаяСистема", 
		"2Can:Сервис приема платежей",
		"iboxPro1C",
		Истина,
		"1.0.1.9");        
		
	Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(
		Перечисления.ТипыПодключаемогоОборудования.ПлатежнаяСистема,
		"ДрайверАЗУРПлатежнаяСистема", 
		"АЗУР:Платежная система",
		"AddIn.com_azurpos_payment_AzurPosPayment",
		Ложь,
		"1.0.2.1");        
	// Конец Платежные cистемы.
	
#КонецЕсли
	
КонецПроцедуры

// Обновление библиотеки в составе конфигурации.
//                                   
Процедура ОбновлениеБиблиотеки() Экспорт
	
	ОбновитьПоставляемыеДрайвера();
	
КонецПроцедуры

// Возвращает флаг возможности добавления новых драйверов в справочник драйверов
//
Функция ВозможностьДобавленияНовыхДрайверов() Экспорт
	
	МожноДобавлятьНовыеДрайвера = Истина;
	Возврат МожноДобавлятьНовыеДрайвера;
	
КонецФункции

// Возвращает признак возможности обращения к разделенным данным из текущего сеанса.
//  
// Возвращаемое значение:
//  Булево - В случае вызова в неразделенной конфигурации возвращает Истина.
//
Функция ДоступноИспользованиеРазделенныхДанных() Экспорт
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область РаботаСЭлементомФормы

// Дополнительные переопределяемые действия с элементом формы 
// служит для учета специфики визуального отображения в зависимости от типа клиента.
//
Процедура ПодготовитьЭлементУправления(ЭлементУправления, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриСозданииНаСервере".
//
Процедура ЭкземплярОборудованияПриСозданииНаСервере(Объект, ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЧтенииНаСервере".
//
Процедура ЭкземплярОборудованияПриЧтенииНаСервере(ТекущийОбъект, ЭтаФорма) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписьюНаСервере".
//
Процедура ЭкземплярОборудованияПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЗаписиНаСервере".
//
Процедура ЭкземплярОборудованияПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписиНаСервере".
//
Процедура ЭкземплярОборудованияПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаПроверкиЗаполненияНаСервере".
//
Процедура ЭкземплярОборудованияОбработкаПроверкиЗаполненияНаСервере(Объект, ЭтаФорма, Отказ, ПроверяемыеРеквизиты) Экспорт

КонецПроцедуры

#КонецОбласти
